Practice 1: Самостоятельно изучите принцип подстановки Лисков и приведите пример его использования.
Принцип подстановки Лискова (LSP) - это концепция в объектно- ориентированном программировании, которая гласит:
Функции, использующие указатели или ссылки на базовые классы, должны уметь использовать объекты производных классов, не зная об этом.
-------------------------------------------------------------------------------------------------------------------------
Practice 2: Напишите программу, которая просит ввести имя и выводит на консоль строку "Привет, <введенное имя>".
--------------------------------------------------------------------------------------------------------------------------
Practice 3: Приведите примеры для всех типов данных. Примеры должны также включать нулевые значения.
--------------------------------------------------------------------------------------------------------------------------
Practice 4: Напечатайте в консоли свое имя, используя при этом символы в формате Unicode ('\uXXXX').
--------------------------------------------------------------------------------------------------------------------------
Practice 5: Какое значение будет в переменной c после выполнения данного кода?
--------------------------------------------------------------------------------------------------------------------------
int a = 1;
{
    int b = 2;
}
int c = a + b;
Объясните полученный результат.
--------------------------------------------------------------------------------------------------------------------------
Practice 6: Приведите пример использования перегруженного оператора + с объектами типа String и переменными принадлежащим другим типам (объектам и базовым типам).
--------------------------------------------------------------------------------------------------------------------------
Practice 7: Приведите примеры, когда арифметические операции выполняются с переменными различных типов. Объясните результат.
--------------------------------------------------------------------------------------------------------------------------
Practice 8: Приведите примеры сужающего преобразования типов.
--------------------------------------------------------------------------------------------------------------------------
Practice 9: Какое значение будет в переменных b, с и d после выполнения данного кода.
--------------------------------------------------------------------------------------------------------------------------
int a = 120;
byte b = a + 10;
byte c = (byte)(a + 10);
byte d = a + 1;
Объясните полученный результат.
--------------------------------------------------------------------------------------------------------------------------
Practice 10: Самостоятельно изучите, что означает type interface и приведите пример с использование var.
--------------------------------------------------------------------------------------------------------------------------
Practice 11: Изучите утилиту javadoc и научитесь ее пользоваться.
--------------------------------------------------------------------------------------------------------------------------
Practice 12: Приведите примеры использования всех определенных выше операторов с операндами базовых типов, а также с операндами типа String. Для операторов ++ и -- продемонстрируйте префиксную и постфиксную форму записи.
--------------------------------------------------------------------------------------------------------------------------
Practice 13: Приведите примеры использования оператора instanceof. Отдельно рассмотрите случай, когда оператор применятся к null-объекту.
----------------------------------------------------------------------------------------------------------------------------
Practice 14: Приведите примеры использования методы decode().
------------------------------------------------------------------------------------------------------------------------
Practice 15: Приведите все способы создания экземпляра класса Boolean.
------------------------------------------------------------------------------------------------------------------------
Practice 16: В каком случае при автоупаковке/автораспаковке будет брошено исключение NullPointerException. Приведите пример.
------------------------------------------------------------------------------------------------------------------------
Practice 17: Какие значения напечатает следующий код?
------------------------------------------------------------------------------------------------------------------------
int i1 = 128;
Integer a1 = i1;
Integer b1 = i1;
System.out.println("a1==i1 " + (a1 == i1));
System.out.println("b1==i1 " + (b1 == i1));
System.out.println("a1==b1 " + (a1 == b1));
System.out.println("a1.equals(i1) -> " + a1.equals(i1));
System.out.println("b1.equals(i1) -> " + b1.equals(i1));
System.out.println("a1.equals(b1) -> " + a1.equals(b1));

int i2 = 127;
Integer a2 = i2;
Integer b2 = i2;
System.out.println("a2==i2 " + (a2 == i2));
System.out.println("b2==i2 " + (b2 == i2));
System.out.println("a2==b2 " + (a2 == b2));
System.out.println("a2.equals(i2) -> " + a2.equals(i2));
System.out.println("b2.equals(i2) -> " + b2.equals(i2));
System.out.println("a2.equals(b2) -> " + a2.equals(b2));

Объясните полученный результат. Для чего используется класс IntegerCache?
--------------------------------------------------------------------------------------------------------------------------
Practice 18: Запишите следующий код через конструкцию ? :
--------------------------------------------------------------------------------------------------------------------------

int i = 0;
if (a == 1) {
    i = 1;
} else if (a == 2) {
    i = 2;
} else {
    i = 3; 
}

--------------------------------------------------------------------------------------------------------------------------
Practice 19: Какого типа может быть переменная в switch? Приведите примеры для всех возможных случаев.
--------------------------------------------------------------------------------------------------------------------------
Practice 20: Что произойдет, если в некоторых частях case будет отсутствовать break, как в следующем примере?
--------------------------------------------------------------------------------------------------------------------------

...
case 1:
    i = 1;
    break;
case 2:
    i = 2;
case 3:
    i = 3;
    break;
...

--------------------------------------------------------------------------------------------------------------------------
Practice 21: Приведите тривиальные примеры бесконечных циклов для конструкций while и do-while.
--------------------------------------------------------------------------------------------------------------------------
Practice 22: Приведите пример использования операторов break и continue с любым видом цикла.
--------------------------------------------------------------------------------------------------------------------------
